//Напишите программу,которая выводит на экран «5,4,3,2,1» используя цикл for.
package task1;

public class five {
    public static void main(String[] args) {
        for(int i=5; i>0;--i)
            System.out.println(i);

    }
}