//Написать программу, которая увеличивает вам зарплату каждый месяц на $1000,используя циклы for
package task1.three;

public class two {
    public static void main(String[] args) {
        for (int i = 0; i <= 12000; i = i + 1000) {
            System.out.println("Зарплата за " + i + "$");
        }
    }
}
